grevaillot/svd_tools/headers/STM32F413/otg_fs_device.h
#define OTG_FS_DEVICE_FS_DCFG_DAD_SHIFT		4
#define OTG_FS_DEVICE_FS_DCFG_DAD_MASK		0x7f
/** @defgroup otg_fs_device_fs_dcfg_dad DAD Device address
@{*/
/**@}*/

/** OTG_FS_DEVICE_FS_DCFG_NZLSOHSK Non-zero-length status OUT handshake **/
#define OTG_FS_DEVICE_FS_DCFG_NZLSOHSK		(1 << 2)

#define OTG_FS_DEVICE_FS_DCFG_DSPD_SHIFT		0
#define OTG_FS_DEVICE_FS_DCFG_DSPD_MASK		0x03
/** @defgroup otg_fs_device_fs_dcfg_dspd DSPD Device speed
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_fs_dctl FSDCTL OTG_FS device control register (OTG_FS_DCTL)
@{*/

/** OTG_FS_DEVICE_FS_DCTL_POPRGDNE Power-on programming done **/
#define OTG_FS_DEVICE_FS_DCTL_POPRGDNE		(1 << 11)
/** OTG_FS_DEVICE_FS_DCTL_CGONAK Clear global OUT NAK **/
#define OTG_FS_DEVICE_FS_DCTL_CGONAK		(1 << 10)
/** OTG_FS_DEVICE_FS_DCTL_SGONAK Set global OUT NAK **/
#define OTG_FS_DEVICE_FS_DCTL_SGONAK		(1 << 9)
/** OTG_FS_DEVICE_FS_DCTL_CGINAK Clear global IN NAK **/
#define OTG_FS_DEVICE_FS_DCTL_CGINAK		(1 << 8)
/** OTG_FS_DEVICE_FS_DCTL_SGINAK Set global IN NAK **/
#define OTG_FS_DEVICE_FS_DCTL_SGINAK		(1 << 7)

#define OTG_FS_DEVICE_FS_DCTL_TCTL_SHIFT		4
#define OTG_FS_DEVICE_FS_DCTL_TCTL_MASK		0x07
/** @defgroup otg_fs_device_fs_dctl_tctl TCTL Test control
@{*/
/**@}*/

/** OTG_FS_DEVICE_FS_DCTL_GONSTS Global OUT NAK status **/
#define OTG_FS_DEVICE_FS_DCTL_GONSTS		(1 << 3)
/** OTG_FS_DEVICE_FS_DCTL_GINSTS Global IN NAK status **/
#define OTG_FS_DEVICE_FS_DCTL_GINSTS		(1 << 2)
/** OTG_FS_DEVICE_FS_DCTL_SDIS Soft disconnect **/
#define OTG_FS_DEVICE_FS_DCTL_SDIS		(1 << 1)
/** OTG_FS_DEVICE_FS_DCTL_RWUSIG Remote wakeup signaling **/
#define OTG_FS_DEVICE_FS_DCTL_RWUSIG		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_fs_dsts FSDSTS OTG_FS device status register (OTG_FS_DSTS)
@{*/


#define OTG_FS_DEVICE_FS_DSTS_DEVLNSTS_SHIFT		22
#define OTG_FS_DEVICE_FS_DSTS_DEVLNSTS_MASK		0x03
/** @defgroup otg_fs_device_fs_dsts_devlnsts DEVLNSTS Device line status
@{*/
/**@}*/


#define OTG_FS_DEVICE_FS_DSTS_FNSOF_SHIFT		8
#define OTG_FS_DEVICE_FS_DSTS_FNSOF_MASK		0x3fff
/** @defgroup otg_fs_device_fs_dsts_fnsof FNSOF Frame number of the received SOF
@{*/
/**@}*/

/** OTG_FS_DEVICE_FS_DSTS_EERR Erratic error **/
#define OTG_FS_DEVICE_FS_DSTS_EERR		(1 << 3)

#define OTG_FS_DEVICE_FS_DSTS_ENUMSPD_SHIFT		1
#define OTG_FS_DEVICE_FS_DSTS_ENUMSPD_MASK		0x03
/** @defgroup otg_fs_device_fs_dsts_enumspd ENUMSPD Enumerated speed
@{*/
/**@}*/

/** OTG_FS_DEVICE_FS_DSTS_SUSPSTS Suspend status **/
#define OTG_FS_DEVICE_FS_DSTS_SUSPSTS		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_fs_diepmsk FSDIEPMSK OTG_FS device IN endpoint common interrupt mask register (OTG_FS_DIEPMSK)
@{*/

/** OTG_FS_DEVICE_FS_DIEPMSK_INEPNEM IN endpoint NAK effective mask **/
#define OTG_FS_DEVICE_FS_DIEPMSK_INEPNEM		(1 << 6)
/** OTG_FS_DEVICE_FS_DIEPMSK_INEPNMM IN token received with EP mismatch mask **/
#define OTG_FS_DEVICE_FS_DIEPMSK_INEPNMM		(1 << 5)
/** OTG_FS_DEVICE_FS_DIEPMSK_ITTXFEMSK IN token received when TxFIFO empty mask **/
#define OTG_FS_DEVICE_FS_DIEPMSK_ITTXFEMSK		(1 << 4)
/** OTG_FS_DEVICE_FS_DIEPMSK_TOM Timeout condition mask (Non-isochronous endpoints) **/
#define OTG_FS_DEVICE_FS_DIEPMSK_TOM		(1 << 3)
/** OTG_FS_DEVICE_FS_DIEPMSK_EPDM Endpoint disabled interrupt mask **/
#define OTG_FS_DEVICE_FS_DIEPMSK_EPDM		(1 << 1)
/** OTG_FS_DEVICE_FS_DIEPMSK_XFRCM Transfer completed interrupt mask **/
#define OTG_FS_DEVICE_FS_DIEPMSK_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_fs_doepmsk FSDOEPMSK OTG_FS device OUT endpoint common interrupt mask register (OTG_FS_DOEPMSK)
@{*/

/** OTG_FS_DEVICE_FS_DOEPMSK_OTEPDM OUT token received when endpoint disabled mask **/
#define OTG_FS_DEVICE_FS_DOEPMSK_OTEPDM		(1 << 4)
/** OTG_FS_DEVICE_FS_DOEPMSK_STUPM SETUP phase done mask **/
#define OTG_FS_DEVICE_FS_DOEPMSK_STUPM		(1 << 3)
/** OTG_FS_DEVICE_FS_DOEPMSK_EPDM Endpoint disabled interrupt mask **/
#define OTG_FS_DEVICE_FS_DOEPMSK_EPDM		(1 << 1)
/** OTG_FS_DEVICE_FS_DOEPMSK_XFRCM Transfer completed interrupt mask **/
#define OTG_FS_DEVICE_FS_DOEPMSK_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_fs_daint FSDAINT OTG_FS device all endpoints interrupt register (OTG_FS_DAINT)
@{*/


#define OTG_FS_DEVICE_FS_DAINT_OEPINT_SHIFT		16
#define OTG_FS_DEVICE_FS_DAINT_OEPINT_MASK		0xffff
/** @defgroup otg_fs_device_fs_daint_oepint OEPINT OUT endpoint interrupt bits
@{*/
/**@}*/


#define OTG_FS_DEVICE_FS_DAINT_IEPINT_SHIFT		0
#define OTG_FS_DEVICE_FS_DAINT_IEPINT_MASK		0xffff
/** @defgroup otg_fs_device_fs_daint_iepint IEPINT IN endpoint interrupt bits
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_fs_daintmsk FSDAINTMSK OTG_FS all endpoints interrupt mask register (OTG_FS_DAINTMSK)
@{*/


#define OTG_FS_DEVICE_FS_DAINTMSK_OEPINT_SHIFT		16
#define OTG_FS_DEVICE_FS_DAINTMSK_OEPINT_MASK		0xffff
/** @defgroup otg_fs_device_fs_daintmsk_oepint OEPINT OUT endpoint interrupt bits
@{*/
/**@}*/


#define OTG_FS_DEVICE_FS_DAINTMSK_IEPM_SHIFT		0
#define OTG_FS_DEVICE_FS_DAINTMSK_IEPM_MASK		0xffff
/** @defgroup otg_fs_device_fs_daintmsk_iepm IEPM IN EP interrupt mask bits
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_dvbusdis DVBUSDIS OTG_FS device VBUS discharge time register
@{*/


#define OTG_FS_DEVICE_DVBUSDIS_VBUSDT_SHIFT		0
#define OTG_FS_DEVICE_DVBUSDIS_VBUSDT_MASK		0xffff
/** @defgroup otg_fs_device_dvbusdis_vbusdt VBUSDT Device VBUS discharge time
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_dvbuspulse DVBUSPULSE OTG_FS device VBUS pulsing time register
@{*/


#define OTG_FS_DEVICE_DVBUSPULSE_DVBUSP_SHIFT		0
#define OTG_FS_DEVICE_DVBUSPULSE_DVBUSP_MASK		0xfff
/** @defgroup otg_fs_device_dvbuspulse_dvbusp DVBUSP Device VBUS pulsing time
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_diepempmsk DIEPEMPMSK OTG_FS device IN endpoint FIFO empty interrupt mask register
@{*/


#define OTG_FS_DEVICE_DIEPEMPMSK_INEPTXFEM_SHIFT		0
#define OTG_FS_DEVICE_DIEPEMPMSK_INEPTXFEM_MASK		0xffff
/** @defgroup otg_fs_device_diepempmsk_ineptxfem INEPTXFEM IN EP Tx FIFO empty interrupt mask bits
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_fs_diepctl0 FSDIEPCTL0 OTG_FS device control IN endpoint 0 control register (OTG_FS_DIEPCTL0)
@{*/

/** OTG_FS_DEVICE_FS_DIEPCTL0_EPENA Endpoint enable **/
#define OTG_FS_DEVICE_FS_DIEPCTL0_EPENA		(1 << 31)
/** OTG_FS_DEVICE_FS_DIEPCTL0_EPDIS Endpoint disable **/
#define OTG_FS_DEVICE_FS_DIEPCTL0_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_FS_DIEPCTL0_SNAK Set NAK **/
#define OTG_FS_DEVICE_FS_DIEPCTL0_SNAK		(1 << 27)
/** OTG_FS_DEVICE_FS_DIEPCTL0_CNAK Clear NAK **/
#define OTG_FS_DEVICE_FS_DIEPCTL0_CNAK		(1 << 26)

#define OTG_FS_DEVICE_FS_DIEPCTL0_TXFNUM_SHIFT		22
#define OTG_FS_DEVICE_FS_DIEPCTL0_TXFNUM_MASK		0x0f
/** @defgroup otg_fs_device_fs_diepctl0_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG_FS_DEVICE_FS_DIEPCTL0_STALL STALL handshake **/
#define OTG_FS_DEVICE_FS_DIEPCTL0_STALL		(1 << 21)

