grevaillot/svd_tools/headers/STM32F413/otg_fs_device.h
#define OTG_FS_DEVICE_DIEPCTL2_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_DIEPCTL2_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_diepctl2_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_diepint2 DIEPINT2 device endpoint-2 interrupt register
@{*/

/** OTG_FS_DEVICE_DIEPINT2_TXFE TXFE **/
#define OTG_FS_DEVICE_DIEPINT2_TXFE		(1 << 7)
/** OTG_FS_DEVICE_DIEPINT2_INEPNE INEPNE **/
#define OTG_FS_DEVICE_DIEPINT2_INEPNE		(1 << 6)
/** OTG_FS_DEVICE_DIEPINT2_ITTXFE ITTXFE **/
#define OTG_FS_DEVICE_DIEPINT2_ITTXFE		(1 << 4)
/** OTG_FS_DEVICE_DIEPINT2_TOC TOC **/
#define OTG_FS_DEVICE_DIEPINT2_TOC		(1 << 3)
/** OTG_FS_DEVICE_DIEPINT2_EPDISD EPDISD **/
#define OTG_FS_DEVICE_DIEPINT2_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_DIEPINT2_XFRC XFRC **/
#define OTG_FS_DEVICE_DIEPINT2_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_dieptsiz2 DIEPTSIZ2 device endpoint-2 transfer size register
@{*/


#define OTG_FS_DEVICE_DIEPTSIZ2_MCNT_SHIFT		29
#define OTG_FS_DEVICE_DIEPTSIZ2_MCNT_MASK		0x03
/** @defgroup otg_fs_device_dieptsiz2_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG_FS_DEVICE_DIEPTSIZ2_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_DIEPTSIZ2_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_dieptsiz2_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_DIEPTSIZ2_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_DIEPTSIZ2_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_dieptsiz2_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_dtxfsts2 DTXFSTS2 OTG_FS device IN endpoint transmit FIFO status register
@{*/


#define OTG_FS_DEVICE_DTXFSTS2_INEPTFSAV_SHIFT		0
#define OTG_FS_DEVICE_DTXFSTS2_INEPTFSAV_MASK		0xffff
/** @defgroup otg_fs_device_dtxfsts2_ineptfsav INEPTFSAV IN endpoint TxFIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_diepctl3 DIEPCTL3 OTG device endpoint-3 control register
@{*/

/** OTG_FS_DEVICE_DIEPCTL3_EPENA EPENA **/
#define OTG_FS_DEVICE_DIEPCTL3_EPENA		(1 << 31)
/** OTG_FS_DEVICE_DIEPCTL3_EPDIS EPDIS **/
#define OTG_FS_DEVICE_DIEPCTL3_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_DIEPCTL3_SODDFRM SODDFRM **/
#define OTG_FS_DEVICE_DIEPCTL3_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_DIEPCTL3_SD0PID_SEVNFRM SD0PID/SEVNFRM **/
#define OTG_FS_DEVICE_DIEPCTL3_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_DIEPCTL3_SNAK SNAK **/
#define OTG_FS_DEVICE_DIEPCTL3_SNAK		(1 << 27)
/** OTG_FS_DEVICE_DIEPCTL3_CNAK CNAK **/
#define OTG_FS_DEVICE_DIEPCTL3_CNAK		(1 << 26)

#define OTG_FS_DEVICE_DIEPCTL3_TXFNUM_SHIFT		22
#define OTG_FS_DEVICE_DIEPCTL3_TXFNUM_MASK		0x0f
/** @defgroup otg_fs_device_diepctl3_txfnum TXFNUM TXFNUM
@{*/
/**@}*/

/** OTG_FS_DEVICE_DIEPCTL3_Stall Stall **/
#define OTG_FS_DEVICE_DIEPCTL3_Stall		(1 << 21)

#define OTG_FS_DEVICE_DIEPCTL3_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_DIEPCTL3_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_diepctl3_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** OTG_FS_DEVICE_DIEPCTL3_NAKSTS NAKSTS **/
#define OTG_FS_DEVICE_DIEPCTL3_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_DIEPCTL3_EONUM_DPID EONUM/DPID **/
#define OTG_FS_DEVICE_DIEPCTL3_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_DIEPCTL3_USBAEP USBAEP **/
#define OTG_FS_DEVICE_DIEPCTL3_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_DIEPCTL3_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_DIEPCTL3_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_diepctl3_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_diepint3 DIEPINT3 device endpoint-3 interrupt register
@{*/

/** OTG_FS_DEVICE_DIEPINT3_TXFE TXFE **/
#define OTG_FS_DEVICE_DIEPINT3_TXFE		(1 << 7)
/** OTG_FS_DEVICE_DIEPINT3_INEPNE INEPNE **/
#define OTG_FS_DEVICE_DIEPINT3_INEPNE		(1 << 6)
/** OTG_FS_DEVICE_DIEPINT3_ITTXFE ITTXFE **/
#define OTG_FS_DEVICE_DIEPINT3_ITTXFE		(1 << 4)
/** OTG_FS_DEVICE_DIEPINT3_TOC TOC **/
#define OTG_FS_DEVICE_DIEPINT3_TOC		(1 << 3)
/** OTG_FS_DEVICE_DIEPINT3_EPDISD EPDISD **/
#define OTG_FS_DEVICE_DIEPINT3_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_DIEPINT3_XFRC XFRC **/
#define OTG_FS_DEVICE_DIEPINT3_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_dieptsiz3 DIEPTSIZ3 device endpoint-3 transfer size register
@{*/


#define OTG_FS_DEVICE_DIEPTSIZ3_MCNT_SHIFT		29
#define OTG_FS_DEVICE_DIEPTSIZ3_MCNT_MASK		0x03
/** @defgroup otg_fs_device_dieptsiz3_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG_FS_DEVICE_DIEPTSIZ3_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_DIEPTSIZ3_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_dieptsiz3_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_DIEPTSIZ3_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_DIEPTSIZ3_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_dieptsiz3_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_dtxfsts3 DTXFSTS3 OTG_FS device IN endpoint transmit FIFO status register
@{*/


#define OTG_FS_DEVICE_DTXFSTS3_INEPTFSAV_SHIFT		0
#define OTG_FS_DEVICE_DTXFSTS3_INEPTFSAV_MASK		0xffff
/** @defgroup otg_fs_device_dtxfsts3_ineptfsav INEPTFSAV IN endpoint TxFIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_doepctl0 DOEPCTL0 device endpoint-0 control register
@{*/

/** OTG_FS_DEVICE_DOEPCTL0_EPENA EPENA **/
#define OTG_FS_DEVICE_DOEPCTL0_EPENA		(1 << 31)
/** OTG_FS_DEVICE_DOEPCTL0_EPDIS EPDIS **/
#define OTG_FS_DEVICE_DOEPCTL0_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_DOEPCTL0_SNAK SNAK **/
#define OTG_FS_DEVICE_DOEPCTL0_SNAK		(1 << 27)
/** OTG_FS_DEVICE_DOEPCTL0_CNAK CNAK **/
#define OTG_FS_DEVICE_DOEPCTL0_CNAK		(1 << 26)
/** OTG_FS_DEVICE_DOEPCTL0_Stall Stall **/
#define OTG_FS_DEVICE_DOEPCTL0_Stall		(1 << 21)
/** OTG_FS_DEVICE_DOEPCTL0_SNPM SNPM **/
#define OTG_FS_DEVICE_DOEPCTL0_SNPM		(1 << 20)

#define OTG_FS_DEVICE_DOEPCTL0_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_DOEPCTL0_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_doepctl0_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** OTG_FS_DEVICE_DOEPCTL0_NAKSTS NAKSTS **/
#define OTG_FS_DEVICE_DOEPCTL0_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_DOEPCTL0_USBAEP USBAEP **/
#define OTG_FS_DEVICE_DOEPCTL0_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_DOEPCTL0_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_DOEPCTL0_MPSIZ_MASK		0x03
/** @defgroup otg_fs_device_doepctl0_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_doepint0 DOEPINT0 device endpoint-0 interrupt register
@{*/

/** OTG_FS_DEVICE_DOEPINT0_B2BSTUP B2BSTUP **/
#define OTG_FS_DEVICE_DOEPINT0_B2BSTUP		(1 << 6)
/** OTG_FS_DEVICE_DOEPINT0_OTEPDIS OTEPDIS **/
#define OTG_FS_DEVICE_DOEPINT0_OTEPDIS		(1 << 4)
/** OTG_FS_DEVICE_DOEPINT0_STUP STUP **/
#define OTG_FS_DEVICE_DOEPINT0_STUP		(1 << 3)
/** OTG_FS_DEVICE_DOEPINT0_EPDISD EPDISD **/
#define OTG_FS_DEVICE_DOEPINT0_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_DOEPINT0_XFRC XFRC **/
#define OTG_FS_DEVICE_DOEPINT0_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_doeptsiz0 DOEPTSIZ0 device OUT endpoint-0 transfer size register
@{*/


#define OTG_FS_DEVICE_DOEPTSIZ0_STUPCNT_SHIFT		29
#define OTG_FS_DEVICE_DOEPTSIZ0_STUPCNT_MASK		0x03
/** @defgroup otg_fs_device_doeptsiz0_stupcnt STUPCNT SETUP packet count
@{*/
/**@}*/

