grevaillot/svd_tools/headers/STM32F413/otg_fs_device.h
/** OTG_FS_DEVICE_DOEPTSIZ0_PKTCNT Packet count **/
#define OTG_FS_DEVICE_DOEPTSIZ0_PKTCNT		(1 << 19)

#define OTG_FS_DEVICE_DOEPTSIZ0_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_DOEPTSIZ0_XFRSIZ_MASK		0x7f
/** @defgroup otg_fs_device_doeptsiz0_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_doepctl1 DOEPCTL1 device endpoint-1 control register
@{*/

/** OTG_FS_DEVICE_DOEPCTL1_EPENA EPENA **/
#define OTG_FS_DEVICE_DOEPCTL1_EPENA		(1 << 31)
/** OTG_FS_DEVICE_DOEPCTL1_EPDIS EPDIS **/
#define OTG_FS_DEVICE_DOEPCTL1_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_DOEPCTL1_SODDFRM SODDFRM **/
#define OTG_FS_DEVICE_DOEPCTL1_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_DOEPCTL1_SD0PID_SEVNFRM SD0PID/SEVNFRM **/
#define OTG_FS_DEVICE_DOEPCTL1_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_DOEPCTL1_SNAK SNAK **/
#define OTG_FS_DEVICE_DOEPCTL1_SNAK		(1 << 27)
/** OTG_FS_DEVICE_DOEPCTL1_CNAK CNAK **/
#define OTG_FS_DEVICE_DOEPCTL1_CNAK		(1 << 26)
/** OTG_FS_DEVICE_DOEPCTL1_Stall Stall **/
#define OTG_FS_DEVICE_DOEPCTL1_Stall		(1 << 21)
/** OTG_FS_DEVICE_DOEPCTL1_SNPM SNPM **/
#define OTG_FS_DEVICE_DOEPCTL1_SNPM		(1 << 20)

#define OTG_FS_DEVICE_DOEPCTL1_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_DOEPCTL1_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_doepctl1_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** OTG_FS_DEVICE_DOEPCTL1_NAKSTS NAKSTS **/
#define OTG_FS_DEVICE_DOEPCTL1_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_DOEPCTL1_EONUM_DPID EONUM/DPID **/
#define OTG_FS_DEVICE_DOEPCTL1_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_DOEPCTL1_USBAEP USBAEP **/
#define OTG_FS_DEVICE_DOEPCTL1_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_DOEPCTL1_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_DOEPCTL1_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_doepctl1_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_doepint1 DOEPINT1 device endpoint-1 interrupt register
@{*/

/** OTG_FS_DEVICE_DOEPINT1_B2BSTUP B2BSTUP **/
#define OTG_FS_DEVICE_DOEPINT1_B2BSTUP		(1 << 6)
/** OTG_FS_DEVICE_DOEPINT1_OTEPDIS OTEPDIS **/
#define OTG_FS_DEVICE_DOEPINT1_OTEPDIS		(1 << 4)
/** OTG_FS_DEVICE_DOEPINT1_STUP STUP **/
#define OTG_FS_DEVICE_DOEPINT1_STUP		(1 << 3)
/** OTG_FS_DEVICE_DOEPINT1_EPDISD EPDISD **/
#define OTG_FS_DEVICE_DOEPINT1_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_DOEPINT1_XFRC XFRC **/
#define OTG_FS_DEVICE_DOEPINT1_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_doeptsiz1 DOEPTSIZ1 device OUT endpoint-1 transfer size register
@{*/


#define OTG_FS_DEVICE_DOEPTSIZ1_RXDPID_STUPCNT_SHIFT		29
#define OTG_FS_DEVICE_DOEPTSIZ1_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg_fs_device_doeptsiz1_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_DOEPTSIZ1_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_DOEPTSIZ1_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_doeptsiz1_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_DOEPTSIZ1_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_DOEPTSIZ1_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_doeptsiz1_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_doepctl2 DOEPCTL2 device endpoint-2 control register
@{*/

/** OTG_FS_DEVICE_DOEPCTL2_EPENA EPENA **/
#define OTG_FS_DEVICE_DOEPCTL2_EPENA		(1 << 31)
/** OTG_FS_DEVICE_DOEPCTL2_EPDIS EPDIS **/
#define OTG_FS_DEVICE_DOEPCTL2_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_DOEPCTL2_SODDFRM SODDFRM **/
#define OTG_FS_DEVICE_DOEPCTL2_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_DOEPCTL2_SD0PID_SEVNFRM SD0PID/SEVNFRM **/
#define OTG_FS_DEVICE_DOEPCTL2_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_DOEPCTL2_SNAK SNAK **/
#define OTG_FS_DEVICE_DOEPCTL2_SNAK		(1 << 27)
/** OTG_FS_DEVICE_DOEPCTL2_CNAK CNAK **/
#define OTG_FS_DEVICE_DOEPCTL2_CNAK		(1 << 26)
/** OTG_FS_DEVICE_DOEPCTL2_Stall Stall **/
#define OTG_FS_DEVICE_DOEPCTL2_Stall		(1 << 21)
/** OTG_FS_DEVICE_DOEPCTL2_SNPM SNPM **/
#define OTG_FS_DEVICE_DOEPCTL2_SNPM		(1 << 20)

#define OTG_FS_DEVICE_DOEPCTL2_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_DOEPCTL2_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_doepctl2_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** OTG_FS_DEVICE_DOEPCTL2_NAKSTS NAKSTS **/
#define OTG_FS_DEVICE_DOEPCTL2_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_DOEPCTL2_EONUM_DPID EONUM/DPID **/
#define OTG_FS_DEVICE_DOEPCTL2_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_DOEPCTL2_USBAEP USBAEP **/
#define OTG_FS_DEVICE_DOEPCTL2_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_DOEPCTL2_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_DOEPCTL2_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_doepctl2_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_doepint2 DOEPINT2 device endpoint-2 interrupt register
@{*/

/** OTG_FS_DEVICE_DOEPINT2_B2BSTUP B2BSTUP **/
#define OTG_FS_DEVICE_DOEPINT2_B2BSTUP		(1 << 6)
/** OTG_FS_DEVICE_DOEPINT2_OTEPDIS OTEPDIS **/
#define OTG_FS_DEVICE_DOEPINT2_OTEPDIS		(1 << 4)
/** OTG_FS_DEVICE_DOEPINT2_STUP STUP **/
#define OTG_FS_DEVICE_DOEPINT2_STUP		(1 << 3)
/** OTG_FS_DEVICE_DOEPINT2_EPDISD EPDISD **/
#define OTG_FS_DEVICE_DOEPINT2_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_DOEPINT2_XFRC XFRC **/
#define OTG_FS_DEVICE_DOEPINT2_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_doeptsiz2 DOEPTSIZ2 device OUT endpoint-2 transfer size register
@{*/


#define OTG_FS_DEVICE_DOEPTSIZ2_RXDPID_STUPCNT_SHIFT		29
#define OTG_FS_DEVICE_DOEPTSIZ2_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg_fs_device_doeptsiz2_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_DOEPTSIZ2_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_DOEPTSIZ2_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_doeptsiz2_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_DOEPTSIZ2_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_DOEPTSIZ2_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_doeptsiz2_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_doepctl3 DOEPCTL3 device endpoint-3 control register
@{*/

/** OTG_FS_DEVICE_DOEPCTL3_EPENA EPENA **/
#define OTG_FS_DEVICE_DOEPCTL3_EPENA		(1 << 31)
/** OTG_FS_DEVICE_DOEPCTL3_EPDIS EPDIS **/
#define OTG_FS_DEVICE_DOEPCTL3_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_DOEPCTL3_SODDFRM SODDFRM **/
#define OTG_FS_DEVICE_DOEPCTL3_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_DOEPCTL3_SD0PID_SEVNFRM SD0PID/SEVNFRM **/
#define OTG_FS_DEVICE_DOEPCTL3_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_DOEPCTL3_SNAK SNAK **/
#define OTG_FS_DEVICE_DOEPCTL3_SNAK		(1 << 27)
/** OTG_FS_DEVICE_DOEPCTL3_CNAK CNAK **/
#define OTG_FS_DEVICE_DOEPCTL3_CNAK		(1 << 26)
/** OTG_FS_DEVICE_DOEPCTL3_Stall Stall **/
#define OTG_FS_DEVICE_DOEPCTL3_Stall		(1 << 21)
/** OTG_FS_DEVICE_DOEPCTL3_SNPM SNPM **/
#define OTG_FS_DEVICE_DOEPCTL3_SNPM		(1 << 20)

