grevaillot/svd_tools/headers/STM32F413/otg_fs_device.h
#define OTG_FS_DEVICE_DOEPCTL3_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_DOEPCTL3_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_doepctl3_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** OTG_FS_DEVICE_DOEPCTL3_NAKSTS NAKSTS **/
#define OTG_FS_DEVICE_DOEPCTL3_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_DOEPCTL3_EONUM_DPID EONUM/DPID **/
#define OTG_FS_DEVICE_DOEPCTL3_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_DOEPCTL3_USBAEP USBAEP **/
#define OTG_FS_DEVICE_DOEPCTL3_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_DOEPCTL3_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_DOEPCTL3_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_doepctl3_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_doepint3 DOEPINT3 device endpoint-3 interrupt register
@{*/

/** OTG_FS_DEVICE_DOEPINT3_B2BSTUP B2BSTUP **/
#define OTG_FS_DEVICE_DOEPINT3_B2BSTUP		(1 << 6)
/** OTG_FS_DEVICE_DOEPINT3_OTEPDIS OTEPDIS **/
#define OTG_FS_DEVICE_DOEPINT3_OTEPDIS		(1 << 4)
/** OTG_FS_DEVICE_DOEPINT3_STUP STUP **/
#define OTG_FS_DEVICE_DOEPINT3_STUP		(1 << 3)
/** OTG_FS_DEVICE_DOEPINT3_EPDISD EPDISD **/
#define OTG_FS_DEVICE_DOEPINT3_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_DOEPINT3_XFRC XFRC **/
#define OTG_FS_DEVICE_DOEPINT3_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_doeptsiz3 DOEPTSIZ3 device OUT endpoint-3 transfer size register
@{*/


#define OTG_FS_DEVICE_DOEPTSIZ3_RXDPID_STUPCNT_SHIFT		29
#define OTG_FS_DEVICE_DOEPTSIZ3_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg_fs_device_doeptsiz3_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_DOEPTSIZ3_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_DOEPTSIZ3_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_doeptsiz3_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_DOEPTSIZ3_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_DOEPTSIZ3_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_doeptsiz3_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/
